app/controllers/profiles_controller.rb

  def index
    @user = current_user
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("first_name", "last_name", "website", "email", "bio", "instagram", "twitter", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)